package by.htp.task02.logic;

// Составить программу сравнения введенного числа а и цифры 3. Вывести на экран
// слово «yes», если число а меньше 3; если больше, то вывести слово «no».

public class Task03 {

	public static void task() {

		double a;

		a = 9.3;

		if (a < 3) {
			System.out.println("3. yes");
		} else {
			System.out.println("3. no");
		}
		
	}

}
