package by.htp.task02.logic;

// Составить программу, определяющую результат гадания на ромашке — «любит—не любит»,
// взяв за исходное данное количество лепестков п.

public class Task24 {

	public static void task() {

		int n;

		n = 15;

		if (n % 2 == 0) {
			System.out.println("24. Не любит :(");
		} else {
			System.out.println("24. Любит! :)");
		}
	}

}
